# Project 3 - Part 3 Transformation Steps

In [51]:
# Imports 
import pandas as pd 
import numpy as np 

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

connection_str = "mysql+pymysql://root:Runner1!28@localhost/movies"

In [52]:
# Create engine
engine = create_engine(connection_str)

In [53]:
# confirm it worked
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [54]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

## Normalize Genre:

In [55]:
# Load basics 
basics = pd.read_csv("Data/title_basics.csv.gz")
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

In [56]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79310 entries, 0 to 79309
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79310 non-null  object
 1   titleType       79310 non-null  object
 2   primaryTitle    79310 non-null  object
 3   originalTitle   79310 non-null  object
 4   isAdult         79310 non-null  int64
 5   startYear       79310 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  79310 non-null  int64
 8   genres          79310 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.4+ MB

In [57]:
# Create a new column with single-string genres as list of strings
basics["genres_split"] = basics["genres"].str.split(',')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"

In [58]:
#  separate the list of genres into new rows: one row for each genre a movie belonged to.
exploded_genres = basics.explode("genres_split")
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
79308,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
79308,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
79308,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
79309,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
79309,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [59]:
# Explode the series using .explode() and take the unqiue() entries only 
unique_genres = basics["genres_split"].explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Music', 'Thriller', 'Mystery', 'Musical', 'Action', 'Adventure',
       'Crime', 'Animation', 'Family', 'History', 'War', 'Biography',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [60]:
# Get unique genres sorted alphabetically 
unique_genres = sorted(exploded_genres["genres_split"].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## Create a new title_genres table

In [61]:
title_genres = exploded_genres[["tconst","genres_split"]].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Create a genre mapper dictionary to replace string genres with integers

In [62]:
# Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [63]:
# Make a dictionary with list of unique genres as the key and the new integer id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## Replace the string genres in title_genres with the new interger ids

In [64]:
title_genres["genre_id"]= title_genres["genres_split"].map(genre_map)
title_genres = title_genres.drop(columns = "genres_split")
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
79308  tt9916190         0
79308  tt9916190         2
79308  tt9916190        23
79309  tt9916362         7
79309  tt9916362        11

[148317 rows x 2 columns]

## Convert the genre map dictionary into a dataframe.

In [65]:
# Manually make dataframe with named cols from .keys and .values
genres = pd.DataFrame({"genre_name": genre_id_map.keys(),
                            "genre_id": genre_id_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Saving MySQL tables with tconst as primary key

## Creating a datatype scheme for to_sql:

In [66]:
# Drop unnecessary columns 
basics.drop(columns = ["originalTitle","isAdult","titleType","genres","genres_split"], inplace = True)

In [67]:
# checking the dataypes for basics
basics.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [68]:
from sqlalchemy.types import *
# Calculate max string lengths for object columns
key_len = basics["tconst"].fillna('').map(len).max()
title_len = basics["primaryTitle"].fillna('').map(len).max()
# Create scheme dict sqlalachemy datatype objects
df_scheme = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    "startYear":Float(),
    "endYear":Float(),
    "runtimeMinutes":Integer()}

In [69]:
# Save to sql 
basics.to_sql("title_basics",engine,dtype=df_scheme, if_exists = "replace", index = False)

In [70]:
# Query to add primary key 
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [71]:
# checking the datatypes of title_genres table
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [72]:
# Calculate max string lengths for object columns
key_len = title_genres["tconst"].fillna('').map(len).max()
# Create scheme dict sqlalachemy datatype objects
df_scheme = {
    "tconst": String(key_len+1),
    "genre_id": Integer()}

In [73]:
# Save to sql 
title_genres.to_sql("title_genres",engine,dtype=df_scheme, if_exists = "replace", index = False)

In [74]:
# checking the datatypes of genres table
genres.dtypes

genre_name    object
genre_id       int64
dtype: object

In [75]:
# Calculate max string lengths for object columns
key_len = genres["genre_name"].fillna('').map(len).max()
# Create scheme dict sqlalachemy datatype objects
df_scheme = {
    "genre_name": Text(key_len+1),
    "genre_id": Integer()}

In [76]:
# Save to sql 
genres.to_sql("genres",engine,dtype=df_scheme, if_exists = "replace", index = False)

In [77]:
# load in title_ratings and check datatypes
title_ratings = pd.read_csv("Data/title_ratings.csv.gz")
title_ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [78]:
# Calculate max string lengths for object columns
key_len = title_ratings["tconst"].fillna('').map(len).max()
# Create scheme dict sqlalachemy datatype objects
df_scheme = {
    "tconst": String(key_len+1),
    "averageRating": Float(),
    "numVotes":Integer()}

In [79]:
# Save to sql 
title_ratings.to_sql("title_ratings",engine,dtype=df_scheme, if_exists = "replace", index = False)

In [80]:
# Query to add primary key 
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [81]:
# load in tmbd_data and check datatypes
tmdb_data = pd.read_csv("Data/tmdb_results_combined.csv.gz")
tmdb_data.dtypes

imdb_id                   object
adult                    float64
backdrop_path             object
belongs_to_collection     object
budget                   float64
genres                    object
homepage                  object
id                       float64
original_language         object
original_title            object
overview                  object
popularity               float64
poster_path               object
production_companies      object
production_countries      object
release_date              object
revenue                  float64
runtime                  float64
spoken_languages          object
status                    object
tagline                   object
title                     object
video                    float64
vote_average             float64
vote_count               float64
certification             object
dtype: object

In [82]:
# Keep only necessary columns
tmdb_data = tmdb_data[["imdb_id","revenue","budget","certification"]]

In [83]:
tmdb_data.head()

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0           NaN
1  tt0113092         0.0         0.0           NaN
2  tt0116391         0.0         0.0           NaN
3  tt0118694  12854953.0    150000.0            PG
4  tt0118852         0.0         0.0             R

In [84]:
# rename imdb_id to tconst
tmdb_data.rename(columns = {"imdb_id":"tconst"},inplace = True)

In [85]:
# confirm
tmdb_data.dtypes

tconst            object
revenue          float64
budget           float64
certification     object
dtype: object

In [86]:
# Calculate max string lengths for object columns
imdb_id_len = tmdb_data["tconst"].fillna('').map(len).max()
cert_len = tmdb_data["certification"].fillna('').map(len).max()
# Create scheme dict sqlalachemy datatype objects
df_scheme = {
    "tconst": String(imdb_id_len+1),
    "budget":Float(),
    "revenue":Float(),
    "certification":Text(cert_len+1)}

In [87]:
# Save to sql 
tmdb_data.to_sql("tmdb_data",engine,dtype=df_scheme, if_exists = "replace", index = False)

In [88]:
# Query to add primary key 
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`tconst`);')

# Showing all tables have been created

## title_basics

In [89]:
q = """SELECT *
FROM title_basics
LIMIT 5;"""
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0093119,Grizzly II: Revenge,2020.0,None,74

## title_ratings

In [90]:
q = """SELECT *
FROM title_ratings
LIMIT 5;"""
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1883
1  tt0000002            5.9       250
2  tt0000003            6.5      1668
3  tt0000004            5.8       163
4  tt0000005            6.2      2490

## title_genres

In [91]:
q = """SELECT *
FROM title_genres
LIMIT 5;"""
pd.read_sql(q,engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

## genres

In [92]:
q = """SELECT *
FROM genres
LIMIT 5;"""
pd.read_sql(q,engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## tmdb_data

In [93]:
q = """SELECT *
FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q,engine)

      tconst     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

## Show all tables

In [95]:
q = """SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data